In [119]:
import pandas as pd
from sklearn import preprocessing
from sklearn.model_selection import train_test_split

In [120]:
df= pd.read_csv("Students.csv")

In [121]:
df.head()

   Gender     Degree  Tuition
0    Male  Associate    20000
1  Female  Associate    20000
2    Male  Associate    20000
3    Male  Associate    20000
4    Male   Bachelor    40600

In [122]:
df.describe()

            Tuition
count   1680.000000
mean   54882.857143
std    17577.108710
min    20000.000000
25%    40600.000000
50%    60300.000000
75%    60300.000000
max    90700.000000

In [123]:
dummyGen= pd.get_dummies(df["Gender"])

In [124]:
dummyGen.head()

   Female  Male
0       0     1
1       1     0
2       0     1
3       0     1
4       0     1

In [125]:
dummyDeg= pd.get_dummies(df["Degree"])

In [126]:
dummyDeg.head()

   Associate  Bachelor  Doctorate  Master
0          1         0          0       0
1          1         0          0       0
2          1         0          0       0
3          1         0          0       0
4          0         1          0       0

In [127]:
df=pd.concat([df,dummyGen,dummyDeg], axis=1)

In [128]:
df.drop(["Gender","Degree"], axis=1, inplace=True)

In [129]:
df.head()

   Tuition  Female  Male  Associate  Bachelor  Doctorate  Master
0    20000       0     1          1         0          0       0
1    20000       1     0          1         0          0       0
2    20000       0     1          1         0          0       0
3    20000       0     1          1         0          0       0
4    40600       0     1          0         1          0       0

In [130]:
scaler = preprocessing.StandardScaler()

In [131]:
scaled_df = scaler.fit_transform(df)

In [132]:
names = df.columns

In [133]:
scaled_df = pd.DataFrame(scaled_df, columns=names)

In [134]:
scaled_df.head()

    Tuition    Female      Male  Associate  Bachelor  Doctorate    Master
0 -1.985153 -1.002384  1.002384   4.725816 -0.792406  -0.384111 -0.891556
1 -1.985153  0.997622 -0.997622   4.725816 -0.792406  -0.384111 -0.891556
2 -1.985153 -1.002384  1.002384   4.725816 -0.792406  -0.384111 -0.891556
3 -1.985153 -1.002384  1.002384   4.725816 -0.792406  -0.384111 -0.891556
4 -0.812825 -1.002384  1.002384  -0.211604  1.261980  -0.384111 -0.891556

In [140]:
df[~df["Tuition"]]

KeyError: "None of [Int64Index([-20001, -20001, -20001, -20001, -40601, -40601, -40601, -60301,\n            -40601, -90701,\n            ...\n            -40601, -40601, -60301, -40601, -60301, -60301, -60301, -90701,\n            -40601, -60301],\n           dtype='int64', length=1680)] are in the [columns]"

In [142]:
X= scaled_df[["Female","Male","Associate","Bachelor","Doctorate","Master"]]

In [143]:
y = scaled_df["Tuition"]

In [144]:
train_data, test_data, train_target, test_target = train_test_split(X,y,test_size=0.2)

In [146]:
train_data.head()

        Female      Male  Associate  Bachelor  Doctorate    Master
1409 -1.002384  1.002384  -0.211604 -0.792406  -0.384111  1.121635
78   -1.002384  1.002384  -0.211604  1.261980  -0.384111 -0.891556
1559 -1.002384  1.002384  -0.211604  1.261980  -0.384111 -0.891556
546  -1.002384  1.002384  -0.211604 -0.792406   2.603417 -0.891556
575  -1.002384  1.002384  -0.211604 -0.792406   2.603417 -0.891556

In [147]:
test_data.head()

        Female      Male  Associate  Bachelor  Doctorate    Master
255  -1.002384  1.002384  -0.211604  1.261980  -0.384111 -0.891556
1233 -1.002384  1.002384  -0.211604 -0.792406  -0.384111  1.121635
87   -1.002384  1.002384   4.725816 -0.792406  -0.384111 -0.891556
289   0.997622 -0.997622  -0.211604  1.261980  -0.384111 -0.891556
565  -1.002384  1.002384  -0.211604 -0.792406  -0.384111  1.121635

In [148]:
train_target.head()

1409    0.308285
78     -0.812825
1559   -0.812825
546     2.038322
575     2.038322
Name: Tuition, dtype: float64

In [149]:
test_target.head()

255    -0.812825
1233    0.308285
87     -1.985153
289    -0.812825
565     0.308285
Name: Tuition, dtype: float64

Does my data set have any categorical data, such as Gender or day of the week?

Yes, it Gender and Degree columns

Do my features have data values that range from 0 - 100 or 0-1 or both and more? 

Both